---
kind: property
id: P:Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs.Document
zh: 文档、文件
source: html/9b6e3a58-87f0-b3b6-0432-0e3fffed5040.htm
---
# Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs.Document Property

**中文**: 文档、文件

The document that contains the types with duplicate names.

## Syntax (C#)
```csharp
public Document Document { get; }
```